app/views/students/edit.html.erb

SELECT "school_classes".* FROM "school_classes"
---
  Student Last Name: <%= f.text_field :last_name %><br><br>
  Select class: <%= f.collection_select :school_class_id, SchoolClass.all, :title, :title_to_s %>