app/views/students/new.html.erb

SELECT "school_classes".* FROM "school_classes"
---
  Student Last Name: <%= f.text_field :last_name %><br><br>
  Select class: <%= collection_select(:school_class, :student_id, SchoolClass.all, :title, :title_to_s, prompt: true) %>