app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Geography"], ["room_number", 202], ["created_at", "2020-04-03 16:55:37.903059"], ["updated_at", "2020-04-03 16:55:37.903059"]]