app/controllers/students_controller.rb

    def create
        @student = Student.new(student_params)
        # @student[:first_name] = params[:first_name]
        # @student[:last_name] = params[:last_name]
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Big"], ["last_name", "Bob"], ["created_at", "2020-04-03 17:46:10.348665"], ["updated_at", "2020-04-03 17:46:10.348665"]]